Lab_original/Lab04-heatTransfer/Lab04-heatTransfer/combustor2D_highRe/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication renumberMesh -overwrite

runApplication $(getApplication)

# ----------------------------------------------------------------- end-of-file
